<?
class OrderStatus {
    const STATUS = array(
        "주문",
        "입금",
        "접수",
        "조판",
        "종이발주",
        "출력",
        "인쇄",
        "후공정",
        "입고",
        "출고",
        "배송",
        "구매확정"
    );

    const STATUS_PROC = array(
        "주문" => array(
            "대기" => "110",
            "취소" => "120"
        ),
        "입금" => array(
            "대기" => "210"
        ),
        "접수" => array(
            "대기" => "310",
            "중"   => "320",
            "교정" => "330",
            "보류" => "340"
        ),
        "조판" => array(
            "대기" => "410",
            "중"   => "420",
            "누락" => "430"
        ),
        "종이발주" => array(
            "대기" => "510",
            "완료" => "520",
            "취소" => "530",
        ),
        "출력" => array(
            "준비" => "605",
            "대기" => "610",
            "중"   => "620",
            "취소" => "630"
        ),
        "인쇄" => array(
            "준비" => "705",
            "대기" => "710",
            "중"   => "720",
            "취소" => "730"
        ),
        "후공정" => array(
            "준비" => "805",
            "대기" => "810",
            "중"   => "820",
            "취소" => "830"
        ),
        "입고" => array(
            "대기" => "910",
            "중"   => "920"
        ),
        "출고" => array(
            "대기" => "950",
            "중"   => "960"
        ),
        "배송" => array(
            "대기" => "010",
            "중"   => "011"
        ),
        "구매확정" => array(
            "대기" => "020",
            "완료" => "021"
        )
    );
}
?>
